package method;

public class MethodOrganize {
    /*메서드 사용의 장점
    * 코드의 중복 제거
    * 코드 재사용 : 특정 기능의 캡슐화 -> 필요할 때마다 그 기능을 다시 작성할 필요 없이 해당 메서드 호출 -> 코드 재사용
    * 코드의 가독성 : 이름이 부여된 메서드는 코드가 수행하는 작업을 명확하게 나타냄
    * 모듈성 : 큰 프로그램을 관리 가능한 부분으로 나눌 수 있다
    * 코드 유지 관리(유지보수) : 코드의 특정 부분에 문제가 발생하거나 수정이 필요한 경우, 해당 메서드만 수정하면 된다.
    * 재사용성과 확장성 : 잘 설계된 메서드는 다른 프로그램이나 프로젝트에서도 재사용할 수 있으며, 새로운 기능 추가나 기존 기능을 확장하는데 유용하다.
    * 추상화 : 메서드를 사용하는 곳에서는 메서드의 구현을 몰라도 됨, 프로그램의 다른 부분에서는 복잡한 내부 작업에 대해 알 필요 없이 메서드를 사용할 수 있다.
    * 테스트와 디버깅 용이성 : 개발 메서드는 독립적으로 테스트하고 디버그할 수 있다.
    * */
}
